[
    {
      "english": "to bring out / to expel",
      "root": "خرج",
      "forms": {
        "الماضي المعلوم": "أَخْرَجَ",
        "المضارع المعلوم": "يُخْرِجُ",
        "الماضي المجهول": "أُخْرِجَ",
        "المضارع المجهول": "يُخْرَجُ",
        "المصدر": "إِخْرَاجًا",
        "الأمر": "أَخْرِجْ",
        "النهي": "لا تُخْرِجْ",
        "اسم الفاعل": "مُخْرِجٌ",
        "اسم المفعول": "مُخْرَجٌ"
      }
    },
    {
      "english": "to bring in / to insert",
      "root": "دخل",
      "forms": {
        "الماضي المعلوم": "أَدْخَلَ",
        "المضارع المعلوم": "يُدْخِلُ",
        "الماضي المجهول": "أُدْخِلَ",
        "المضارع المجهول": "يُدْخَلُ",
        "المصدر": "إِدْخَالًا",
        "الأمر": "أَدْخِلْ",
        "النهي": "لا تُدْخِلْ",
        "اسم الفاعل": "مُدْخِلٌ",
        "اسم المفعول": "مُدْخَلٌ"
      }
    },
    {
      "english": "to honor",
      "root": "كرم",
      "forms": {
        "الماضي المعلوم": "أَكْرَمَ",
        "المضارع المعلوم": "يُكْرِمُ",
        "الماضي المجهول": "أُكْرِمَ",
        "المضارع المجهول": "يُكْرَمُ",
        "المصدر": "إِكْرَامًا",
        "الأمر": "أَكْرِمْ",
        "النهي": "لا تُكْرِمْ",
        "اسم الفاعل": "مُكْرِمٌ",
        "اسم المفعول": "مُكْرَمٌ"
      }
    },
    {
      "english": "to inform",
      "root": "علم",
      "forms": {
        "الماضي المعلوم": "أَعْلَمَ",
        "المضارع المعلوم": "يُعْلِمُ",
        "الماضي المجهول": "أُعْلِمَ",
        "المضارع المجهول": "يُعْلَمُ",
        "المصدر": "إِعْلَامًا",
        "الأمر": "أَعْلِمْ",
        "النهي": "لا تُعْلِمْ",
        "اسم الفاعل": "مُعْلِمٌ",
        "اسم المفعول": "مُعْلَمٌ"
      }
    },
    {
      "english": "to submit (to God)",
      "root": "سلم",
      "forms": {
        "الماضي المعلوم": "أَسْلَمَ",
        "المضارع المعلوم": "يُسْلِمُ",
        "الماضي المجهول": "أُسْلِمَ",
        "المضارع المجهول": "يُسْلَمُ",
        "المصدر": "إِسْلَامًا",
        "الأمر": "أَسْلِمْ",
        "النهي": "لا تُسْلِمْ",
        "اسم الفاعل": "مُسْلِمٌ",
        "اسم المفعول": "مُسْلَمٌ"
      }
    },
    {
      "english": "to send down / to reveal",
      "root": "نزل",
      "forms": {
        "الماضي المعلوم": "أَنْزَلَ",
        "المضارع المعلوم": "يُنْزِلُ",
        "الماضي المجهول": "أُنْزِلَ",
        "المضارع المجهول": "يُنْزَلُ",
        "المصدر": "إِنْزَالًا",
        "الأمر": "أَنْزِلْ",
        "النهي": "لا تُنْزِلْ",
        "اسم الفاعل": "مُنْزِلٌ",
        "اسم المفعول": "مُنْزَلٌ"
      }
    },
    {
      "english": "to cut off",
      "root": "قطع",
      "forms": {
        "الماضي المعلوم": "أَقْطَعَ",
        "المضارع المعلوم": "يُقْطِعُ",
        "الماضي المجهول": "أُقْطِعَ",
        "المضارع المجهول": "يُقْطَعُ",
        "المصدر": "إِقْطَاعًا",
        "الأمر": "أَقْطِعْ",
        "النهي": "لا تُقْطِعْ",
        "اسم الفاعل": "مُقْطِعٌ",
        "اسم المفعول": "مُقْطَعٌ"
      }
    },
    {
      "english": "to see / to perceive",
      "root": "بصر",
      "forms": {
        "الماضي المعلوم": "أَبْصَرَ",
        "المضارع المعلوم": "يُبْصِرُ",
        "الماضي المجهول": "أُبْصِرَ",
        "المضارع المجهول": "يُبْصَرُ",
        "المصدر": "إِبْصَارًا",
        "الأمر": "أَبْصِرْ",
        "النهي": "لا تُبْصِرْ",
        "اسم الفاعل": "مُبْصِرٌ",
        "اسم المفعول": "مُبْصَرٌ"
      }
    },
    {
      "english": "to make hear",
      "root": "سمع",
      "forms": {
        "الماضي المعلوم": "أَسْمَعَ",
        "المضارع المعلوم": "يُسْمِعُ",
        "الماضي المجهول": "أُسْمِعَ",
        "المضارع المجهول": "يُسْمَعُ",
        "المصدر": "إِسْمَاعًا",
        "الأمر": "أَسْمِعْ",
        "النهي": "لا تُسْمِعْ",
        "اسم الفاعل": "مُسْمِعٌ",
        "اسم المفعول": "مُسْمَعٌ"
      }
    },
    {
      "english": "to send",
      "root": "رسل",
      "forms": {
        "الماضي المعلوم": "أَرْسَلَ",
        "المضارع المعلوم": "يُرْسِلُ",
        "الماضي المجهول": "أُرْسِلَ",
        "المضارع المجهول": "يُرْسَلُ",
        "المصدر": "إِرْسَالًا",
        "الأمر": "أَرْسِلْ",
        "النهي": "لا تُرْسِلْ",
        "اسم الفاعل": "مُرْسِلٌ",
        "اسم المفعول": "مُرْسَلٌ"
      }
    },
    {
      "english": "to seat (someone)",
      "root": "جلس",
      "forms": {
        "الماضي المعلوم": "أَجْلَسَ",
        "المضارع المعلوم": "يُجْلِسُ",
        "الماضي المجهول": "أُجْلِسَ",
        "المضارع المجهول": "يُجْلَسُ",
        "المصدر": "إِجْلَاسًا",
        "الأمر": "أَجْلِسْ",
        "النهي": "لا تُجْلِسْ",
        "اسم الفاعل": "مُجْلِسٌ",
        "اسم المفعول": "مُجْلَسٌ"
      }
    },
    {
      "english": "to show / to reveal",
      "root": "ظهر",
      "forms": {
        "الماضي المعلوم": "أَظْهَرَ",
        "المضارع المعلوم": "يُظْهِرُ",
        "الماضي المجهول": "أُظْهِرَ",
        "المضارع المجهول": "يُظْهَرُ",
        "المصدر": "إِظْهَارًا",
        "الأمر": "أَظْهِرْ",
        "النهي": "لا تُظْهِرْ",
        "اسم الفاعل": "مُظْهِرٌ",
        "اسم المفعول": "مُظْهَرٌ"
      }
    },
    {
      "english": "to house / to settle (someone)",
      "root": "سكن",
      "forms": {
        "الماضي المعلوم": "أَسْكَنَ",
        "المضارع المعلوم": "يُسْكِنُ",
        "الماضي المجهول": "أُسْكِنَ",
        "المضارع المجهول": "يُسْكَنُ",
        "المصدر": "إِسْكَانًا",
        "الأمر": "أَسْكِنْ",
        "النهي": "لا تُسْكِنْ",
        "اسم الفاعل": "مُسْكِنٌ",
        "اسم المفعول": "مُسْكَنٌ"
      }
    },
    {
      "english": "to cause / to bring about",
      "root": "حدث",
      "forms": {
        "الماضي المعلوم": "أَحْدَثَ",
        "المضارع المعلوم": "يُحْدِثُ",
        "الماضي المجهول": "أُحْدِثَ",
        "المضارع المجهول": "يُحْدَثُ",
        "المصدر": "إِحْدَاثًا",
        "الأمر": "أَحْدِثْ",
        "النهي": "لا تُحْدِثْ",
        "اسم الفاعل": "مُحْدِثٌ",
        "اسم المفعول": "مُحْدَثٌ"
      }
    },
    {
      "english": "to inform / to report",
      "root": "خبر",
      "forms": {
        "الماضي المعلوم": "أَخْبَرَ",
        "المضارع المعلوم": "يُخْبِرُ",
        "الماضي المجهول": "أُخْبِرَ",
        "المضارع المجهول": "يُخْبَرُ",
        "المصدر": "إِخْبَارًا",
        "الأمر": "أَخْبِرْ",
        "النهي": "لا تُخْبِرْ",
        "اسم الفاعل": "مُخْبِرٌ",
        "اسم المفعول": "مُخْبَرٌ"
      }
    },
    {
      "english": "to present / to advance",
      "root": "قدم",
      "forms": {
        "الماضي المعلوم": "أَقْدَمَ",
        "المضارع المعلوم": "يُقْدِمُ",
        "الماضي المجهول": "أُقْدِمَ",
        "المضارع المجهول": "يُقْدَمُ",
        "المصدر": "إِقْدَامًا",
        "الأمر": "أَقْدِمْ",
        "النهي": "لا تُقْدِمْ",
        "اسم الفاعل": "مُقْدِمٌ",
        "اسم المفعول": "مُقْدَمٌ"
      }
    },
    {
      "english": "to associate / to commit shirk",
      "root": "شرك",
      "forms": {
        "الماضي المعلوم": "أَشْرَكَ",
        "المضارع المعلوم": "يُشْرِكُ",
        "الماضي المجهول": "أُشْرِكَ",
        "المضارع المجهول": "يُشْرَكُ",
        "المصدر": "إِشْرَاكًا",
        "الأمر": "أَشْرِكْ",
        "النهي": "لا تُشْرِكْ",
        "اسم الفاعل": "مُشْرِكٌ",
        "اسم المفعول": "مُشْرَكٌ"
      }
    },
    {
      "english": "to begin / to initiate",
      "root": "بدأ",
      "forms": {
        "الماضي المعلوم": "أَبْدَأَ",
        "المضارع المعلوم": "يُبْدِئُ",
        "الماضي المجهول": "أُبْدِئَ",
        "المضارع المجهول": "يُبْدَأُ",
        "المصدر": "إِبْدَاءً",
        "الأمر": "أَبْدِئْ",
        "النهي": "لا تُبْدِئْ",
        "اسم الفاعل": "مُبْدِئٌ",
        "اسم المفعول": "مُبْدَأٌ"
      }
    },
    {
      "english": "to make incline / to turn affection",
      "root": "عطف",
      "forms": {
        "الماضي المعلوم": "أَعْطَفَ",
        "المضارع المعلوم": "يُعْطِفُ",
        "الماضي المجهول": "أُعْطِفَ",
        "المضارع المجهول": "يُعْطَفُ",
        "المصدر": "إِعْطَافًا",
        "الأمر": "أَعْطِفْ",
        "النهي": "لا تُعْطِفْ",
        "اسم الفاعل": "مُعْطِفٌ",
        "اسم المفعول": "مُعْطَفٌ"
      }
    },
    {
      "english": "to make understand",
      "root": "عقل",
      "forms": {
        "الماضي المعلوم": "أَعْقَلَ",
        "المضارع المعلوم": "يُعْقِلُ",
        "الماضي المجهول": "أُعْقِلَ",
        "المضارع المجهول": "يُعْقَلُ",
        "المصدر": "إِعْقَالًا",
        "الأمر": "أَعْقِلْ",
        "النهي": "لا تُعْقِلْ",
        "اسم الفاعل": "مُعْقِلٌ",
        "اسم المفعول": "مُعْقَلٌ"
      }
    },
    {
      "english": "to attach / to join",
      "root": "لحق",
      "forms": {
        "الماضي المعلوم": "أَلْحَقَ",
        "المضارع المعلوم": "يُلْحِقُ",
        "الماضي المجهول": "أُلْحِقَ",
        "المضارع المجهول": "يُلْحَقُ",
        "المصدر": "إِلْحَاقًا",
        "الأمر": "أَلْحِقْ",
        "النهي": "لا تُلْحِقْ",
        "اسم الفاعل": "مُلْحِقٌ",
        "اسم المفعول": "مُلْحَقٌ"
      }
    },
    {
      "english": "to go on strike / to refrain",
      "root": "ضرب",
      "forms": {
        "الماضي المعلوم": "أَضْرَبَ",
        "المضارع المعلوم": "يُضْرِبُ",
        "الماضي المجهول": "أُضْرِبَ",
        "المضارع المجهول": "يُضْرَبُ",
        "المصدر": "إِضْرَابًا",
        "الأمر": "أَضْرِبْ",
        "النهي": "لا تُضْرِبْ",
        "اسم الفاعل": "مُضْرِبٌ",
        "اسم المفعول": "مُضْرَبٌ"
      }
    },
    {
      "english": "to close / to lock",
      "root": "غلق",
      "forms": {
        "الماضي المعلوم": "أَغْلَقَ",
        "المضارع المعلوم": "يُغْلِقُ",
        "الماضي المجهول": "أُغْلِقَ",
        "المضارع المجهول": "يُغْلَقُ",
        "المصدر": "إِغْلَاقًا",
        "الأمر": "أَغْلِقْ",
        "النهي": "لا تُغْلِقْ",
        "اسم الفاعل": "مُغْلِقٌ",
        "اسم المفعول": "مُغْلَقٌ"
      }
    }
]